load-tests/artillery-load-test.yaml
config:
  target: "https://textometr.ru"
  phases:
    - duration: 10
      arrivalCount: 100
scenarios:
  - flow:
      - get:
          url: "/"
      - post:
          url: "/analyze"
          json:
            text: "Замоскворецкий суд Москвы по требованию Генпрокуратуры конфисковал активы депутата Госдумы Сергея Сопчука, сообщает РИА Новости со ссылкой на пресс-службу суда и материалы дела.\n\nПо данным «Коммерсанта», общая стоимость конфискованных активов — 38 миллиардов рублей. По версии Генпрокуратуры, Сопчук, будучи депутатом Госдумы, незаконно занимался предпринимательской деятельностью.\n\nУ депутата изъяли в том числе 99,23% его доли в уставном капитале ООО «Терней золото», уточняет РИА Новости. Как следует из материалов дела, с которыми ознакомилось агентство, активы изъяли в связи с «отсутствием доказательств их приобретения на законные доходы»."
            mode: "foreign"